#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infrastructure relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/devmastery/devmastery/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/devmastery/devmastery

To view this run in a browser, visit:
https://app.terraform.io/app/devmastery/base/runs/run-r6LJJb5dhMi9PB9S

Waiting for the plan to start...

Terraform v1.3.0
on linux_amd64
Initializing plugins and modules...
aws_rds_cluster_parameter_group.postgresql14: Refreshing state... [id=dm-aurora-postgres-cluster-parameter-group]
module.rds-aurora[0].data.aws_partition.current: Reading...
data.aws_rds_engine_version.postgresql: Reading...
module.rds-aurora[0].data.aws_iam_policy_document.monitoring_rds_assume_role: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-047cc163bc32f9c63]
aws_db_parameter_group.postgresql14: Refreshing state... [id=dm-aurora-db-postgres-parameter-group]
module.rds-aurora[0].data.aws_partition.current: Read complete after 0s [id=aws]
module.rds-aurora[0].data.aws_iam_policy_document.monitoring_rds_assume_role: Read complete after 0s [id=1813475199]
module.rds-aurora[0].aws_iam_role.rds_enhanced_monitoring[0]: Refreshing state... [id=terraform-20230225200307833400000001]
module.rds-aurora[0].aws_iam_role_policy_attachment.rds_enhanced_monitoring[0]: Refreshing state... [id=terraform-20230225200307833400000001-20230225200308352900000002]
data.aws_rds_engine_version.postgresql: Read complete after 0s [id=14.6]
module.rds-aurora[0].aws_security_group.this[0]: Refreshing state... [id=sg-04905b235f678a468]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-00946d27ed0da0428]
module.vpc.aws_route_table.database[0]: Refreshing state... [id=rtb-0bd0aae47da69e7b2]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0c146abcf9be4e5cc]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0a7713827cbd44342]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0aa6bd443aa98d474]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0e924e4f34d74a84e]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0134976a0271c4dbe]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-04a5def6c836870f2]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-01bc340a0b260a576]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-00254f2e894d49ae7]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-082f4b3fc14ac4ab5]
module.vpc.aws_route.database_internet_gateway[0]: Refreshing state... [id=r-rtb-0bd0aae47da69e7b21080289494]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=vpc-dev]
module.rds-aurora[0].aws_db_subnet_group.this[0]: Refreshing state... [id=dm-dev-aurorav2-1]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01a9581529b9c2e90]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0aa6bd443aa98d4741080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-051dd6ea88a46ed93]
module.rds-aurora[0].aws_security_group_rule.cidr_ingress[0]: Refreshing state... [id=sgrule-3502655924]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0e9db314492e2d792]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0a6cc174fba3ab2bd]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-02cbf108c39429be8]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-082f24e7b7c154465]
module.rds-aurora[0].aws_rds_cluster.this[0]: Refreshing state... [id=dm-dev-aurorav2-1]
module.rds-aurora[0].aws_rds_cluster_instance.this["b"]: Refreshing state... [id=dm-dev-aurorav2-1-b]
module.rds-aurora[0].aws_rds_cluster_instance.this["a"]: Refreshing state... [id=dm-dev-aurorav2-1-a]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.rds-aurora[0].aws_rds_cluster_instance.this["a"] has changed
  ~ resource "aws_rds_cluster_instance" "this" {
        id                                    = "dm-dev-aurorav2-1-a"
      ~ monitoring_interval                   = 120 -> 60
        tags                                  = {
            "Environment"  = "dev"
            "Organization" = "DevMastery"
        }
        # (29 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.rds-aurora[0].aws_rds_cluster_instance.this["b"] has changed
  ~ resource "aws_rds_cluster_instance" "this" {
        id                                    = "dm-dev-aurorav2-1-b"
      ~ monitoring_interval                   = 120 -> 60
        tags                                  = {
            "Environment"  = "dev"
            "Organization" = "DevMastery"
        }
        # (29 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_deployment.newsletter_subscription_api_deployment will be created
  + resource "aws_api_gateway_deployment" "newsletter_subscription_api_deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + triggers      = {
          + "redeployment" = "3157e168302b364c8f6df87e06a16101cc8c6013"
        }
    }

  # aws_api_gateway_rest_api.newsletter_subscription_api will be created
  + resource "aws_api_gateway_rest_api" "newsletter_subscription_api" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + body                         = "\"openapi: 3.0.2\\ninfo:\\n  title: Newsletter Subscription API\\n  version: 1.0.0\\n  description: An API to manage Newsletter Subscriptions\\npaths:\\n  /newsletter-subscriptions:\\n    summary: Path used to manage the list of newslettersubscriptions.\\n    description: \\u003e-\\n      The REST endpoint/path used to list and create zero or more `NewsletterSubscription` entities. \\n      This path contains a `GET` and `POST` operation to perform the list and create tasks,\\n      respectively.\\n    get:\\n      x-amazon-apigateway-integration:\\n        responses:\\n          default:\\n            statusCode: \\\"200\\\"\\n        passthroughBehavior: when_no_match\\n        httpMethod: GET\\n        type: aws_proxy\\n      responses:\\n        \\\"200\\\":\\n          content:\\n            application/json:\\n              schema:\\n                type: array\\n                items:\\n                  $ref: \\\"#/components/schemas/NewsletterSubscription\\\"\\n          description: Successful response - returns an array of `NewsletterSubscription` entities.\\n      operationId: getNewsletterSubscriptions\\n      summary: List All NewsletterSubscriptions\\n      description: Gets a list of all `NewsletterSubscription` entities.\\n    post:\\n      x-amazon-apigateway-integration:\\n        responses:\\n          default:\\n            statusCode: \\\"201\\\"\\n        passthroughBehavior: when_no_match\\n        httpMethod: POST\\n        type: aws_proxy\\n      requestBody:\\n        description: A new `NewsletterSubscription` to be created.\\n        content:\\n          application/json:\\n            schema:\\n              $ref: \\\"#/components/schemas/NewsletterSubscription\\\"\\n        required: true\\n      responses:\\n        \\\"201\\\":\\n          description: Successful response.\\n      operationId: createNewsletterSubscription\\n      summary: Create a NewsletterSubscription\\n      description: Creates a new instance of a `NewsletterSubscription`.\\n  \\\"/newsletter-subscriptions/{newsletterSubscriptionId}\\\":\\n    summary: Path used to manage a single NewsletterSubscription.\\n    description: \\u003e-\\n      The REST endpoint/path used to get, update, and delete single instances of an\\n      `NewsletterSubscription`.  This path contains `GET`, `PUT`, and `DELETE` operations used to\\n      perform the get, update, and delete tasks, respectively.\\n    get:\\n      x-amazon-apigateway-integration:\\n        responses:\\n          default:\\n            statusCode: \\\"200\\\"\\n        passthroughBehavior: when_no_match\\n        httpMethod: GET\\n        type: aws_proxy\\n      responses:\\n        \\\"200\\\":\\n          content:\\n            application/json:\\n              schema:\\n                $ref: \\\"#/components/schemas/NewsletterSubscription\\\"\\n          description: Successful response - returns a single `NewsletterSubscription`.\\n      operationId: getNewsletterSubscription\\n      summary: Get a NewsletterSubscription\\n      description: Gets the details of a single instance of a `NewsletterSubscription`.\\n    put:\\n      x-amazon-apigateway-integration:\\n        responses:\\n          default:\\n            statusCode: \\\"202\\\"\\n        passthroughBehavior: when_no_match\\n        httpMethod: PUT\\n        type: aws_proxy\\n      requestBody:\\n        description: Updated `NewsletterSubscription` information.\\n        content:\\n          application/json:\\n            schema:\\n              $ref: \\\"#/components/schemas/NewsletterSubscription\\\"\\n        required: true\\n      responses:\\n        \\\"202\\\":\\n          description: Successful response.\\n      operationId: updateNewsletterSubscription\\n      summary: Update a NewsletterSubscription\\n      description: Updates an existing `NewsletterSubscription`.\\n    delete:\\n      x-amazon-apigateway-integration:\\n        responses:\\n          default:\\n            statusCode: \\\"204\\\"\\n        passthroughBehavior: when_no_match\\n        httpMethod: DELETE\\n        type: aws_proxy\\n      responses:\\n        \\\"204\\\":\\n          description: Successful response.\\n      operationId: deleteNewsletterSubscription\\n      summary: Delete a NewsletterSubscription\\n      description: Deletes an existing `NewsletterSubscription`.\\n    parameters:\\n      - examples:\\n          UUID:\\n            value: 76b02a81-f8a6-4d09-b19c-250336249f78\\n        name: newsletterSubscriptionId\\n        description: A unique identifier for a `NewsletterSubscription`.\\n        schema:\\n          type: string\\n        in: path\\n        required: true\\ncomponents:\\n  schemas:\\n    NewsletterSubscription:\\n      title: Root Type for NewsletterSubscription\\n      description: \\\"\\\"\\n      required:\\n        - emailAddress\\n        - id\\n        - informedConsent\\n        - subscribedAt\\n        - newsletterId\\n        - firstName\\n      type: object\\n      properties:\\n        id:\\n          pattern: '^[0-9a-fA-F]{8}\\\\b-[0-9a-fA-F]{4}\\\\b-[0-9a-fA-F]{4}\\\\b-[0-9a-fA-F]{4}\\\\b-[0-9a-fA-F]{12}$'\\n          type: string\\n          example: 757f2ef1-08dd-4856-a375-22daf5beb19b\\n        firstName:\\n          minLength: 2\\n          type: string\\n          example: Aisha\\n        emailAddress:\\n          type: string\\n          example: a.jones@abc.com\\n        newsletterId:\\n          pattern: '^[0-9a-fA-F]{8}\\\\b-[0-9a-fA-F]{4}\\\\b-[0-9a-fA-F]{4}\\\\b-[0-9a-fA-F]{4}\\\\b-[0-9a-fA-F]{12}$'\\n          type: string\\n          example: 66e4c6f6-3263-4fba-99a9-ff188c50befc\\n        verifiedEmailAddress:\\n          pattern: '[^@ \\\\t\\\\r\\\\n]+@[^@ \\\\t\\\\r\\\\n]+\\\\.[^@ \\\\t\\\\r\\\\n]+'\\n          type: string\\n          example: a.jones@abc.com\\n        informedConsent:\\n          pattern: '[^@ \\\\t\\\\r\\\\n]+@[^@ \\\\t\\\\r\\\\n]+\\\\.[^@ \\\\t\\\\r\\\\n]+'\\n          type: string\\n          example: I agree to receive emails from DevMastery.com\\n        subscribedAt:\\n          format: date-time\\n          type: string\\n          example: \\\"2023-02-02T00:00:00Z\\\"\\n      example:\\n        id: 757f2ef1-08dd-4856-a375-22daf5beb19b\\n        firstName: Aisha\\n        emailAddress: a.jones@abc.com\\n        newsletterId: 66e4c6f6-3263-4fba-99a9-ff188c50befc\\n        verifiedEmailAddress: a.jones@abc.com\\n        informedConsent: I agree to receive emails from DevMastery.com\\n        subscribedAt: \\\"2023-02-02T00:00:00Z\\\"\\n\""
      + created_date                 = (known after apply)
      + description                  = "A service for subscribing to newsletters"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "newsletter-subscription-api"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + types            = (known after apply)
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # aws_api_gateway_stage.newsletter_subscription_api_stage will be created
  + resource "aws_api_gateway_stage" "newsletter_subscription_api_stage" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "dev"
      + tags_all      = (known after apply)
      + web_acl_arn   = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.


```
</details>
*Pushed by: @arcdev1, Action: `pull_request`*